; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared2 - mode
	infrared0 - mode
	spectrograph3 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star3 - direction
	Star4 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Planet7 infrared1)
	(have_image Planet8 infrared0)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 spectrograph3)
	(have_image Planet13 infrared1)
	(have_image Star14 infrared0)
	(have_image Planet15 spectrograph3)
	(have_image Star16 infrared2)
))

)

; plan
1. (turn_to satellite0 star3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star16 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star16)
   goals met: 0 of 10
5. (take_image satellite0 star16 instrument0 infrared2)
   added: (have_image star16 infrared2)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon11 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 10
10. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 3 of 10
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
13. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 3 of 10
14. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
15. (take_image satellite0 phenomenon12 instrument1 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 4 of 10
16. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 4 of 10
17. (take_image satellite0 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 5 of 10
18. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 5 of 10
19. (take_image satellite0 planet15 instrument1 spectrograph3)
   added: (have_image planet15 spectrograph3)
   goals met: 6 of 10
20. (turn_to satellite0 planet7 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet7)
   goals met: 6 of 10
21. (take_image satellite0 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 7 of 10
22. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 10
23. (take_image satellite0 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 8 of 10
24. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 8 of 10
25. (take_image satellite0 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 9 of 10
26. (turn_to satellite0 star14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star14)
   goals met: 9 of 10
27. (take_image satellite0 star14 instrument1 infrared0)
   added: (have_image star14 infrared0)
   goals met: 10 of 10
